; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	image1 - mode
	image0 - mode
	GroundStation3 - direction
	Star2 - direction
	Star1 - direction
	Star0 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(supports instrument1 image0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 171)
	(= (data Phenomenon4 infrared2) 98)
	(= (data Phenomenon5 infrared2) 297)
	(= (data Planet6 infrared2) 57)
	(= (data Phenomenon7 infrared2) 114)
	(= (data Phenomenon4 image1) 56)
	(= (data Phenomenon5 image1) 244)
	(= (data Planet6 image1) 80)
	(= (data Phenomenon7 image1) 294)
	(= (data Phenomenon4 image0) 136)
	(= (data Phenomenon5 image0) 22)
	(= (data Planet6 image0) 108)
	(= (data Phenomenon7 image0) 36)
	(= (slew_time GroundStation3 Star0) 35.58)
	(= (slew_time Star0 GroundStation3) 35.58)
	(= (slew_time GroundStation3 Star1) 10.91)
	(= (slew_time Star1 GroundStation3) 10.91)
	(= (slew_time GroundStation3 Star2) 6.711)
	(= (slew_time Star2 GroundStation3) 6.711)
	(= (slew_time Star2 Star0) 30.28)
	(= (slew_time Star0 Star2) 30.28)
	(= (slew_time Star2 Star1) 56.85)
	(= (slew_time Star1 Star2) 56.85)
	(= (slew_time Star1 Star0) 44.77)
	(= (slew_time Star0 Star1) 44.77)
	(= (slew_time Phenomenon4 Star0) 20.46)
	(= (slew_time Star0 Phenomenon4) 20.46)
	(= (slew_time Phenomenon4 Star1) 56.77)
	(= (slew_time Star1 Phenomenon4) 56.77)
	(= (slew_time Phenomenon4 Star2) 18.96)
	(= (slew_time Star2 Phenomenon4) 18.96)
	(= (slew_time Phenomenon4 GroundStation3) 37.12)
	(= (slew_time GroundStation3 Phenomenon4) 37.12)
	(= (slew_time Phenomenon5 Star0) 10.43)
	(= (slew_time Star0 Phenomenon5) 10.43)
	(= (slew_time Phenomenon5 Star1) 15.22)
	(= (slew_time Star1 Phenomenon5) 15.22)
	(= (slew_time Phenomenon5 Star2) 71.39)
	(= (slew_time Star2 Phenomenon5) 71.39)
	(= (slew_time Phenomenon5 GroundStation3) 29.2)
	(= (slew_time GroundStation3 Phenomenon5) 29.2)
	(= (slew_time Phenomenon5 Phenomenon4) 19.84)
	(= (slew_time Phenomenon4 Phenomenon5) 19.84)
	(= (slew_time Planet6 Star0) 35.7)
	(= (slew_time Star0 Planet6) 35.7)
	(= (slew_time Planet6 Star1) 8.871)
	(= (slew_time Star1 Planet6) 8.871)
	(= (slew_time Planet6 Star2) 1.681)
	(= (slew_time Star2 Planet6) 1.681)
	(= (slew_time Planet6 GroundStation3) 18.16)
	(= (slew_time GroundStation3 Planet6) 18.16)
	(= (slew_time Planet6 Phenomenon4) 15.56)
	(= (slew_time Phenomenon4 Planet6) 15.56)
	(= (slew_time Planet6 Phenomenon5) 87.37)
	(= (slew_time Phenomenon5 Planet6) 87.37)
	(= (slew_time Phenomenon7 Star0) 44.23)
	(= (slew_time Star0 Phenomenon7) 44.23)
	(= (slew_time Phenomenon7 Star1) 11.82)
	(= (slew_time Star1 Phenomenon7) 11.82)
	(= (slew_time Phenomenon7 Star2) 30.43)
	(= (slew_time Star2 Phenomenon7) 30.43)
	(= (slew_time Phenomenon7 GroundStation3) 84.55)
	(= (slew_time GroundStation3 Phenomenon7) 84.55)
	(= (slew_time Phenomenon7 Phenomenon4) 74.61)
	(= (slew_time Phenomenon4 Phenomenon7) 74.61)
	(= (slew_time Phenomenon7 Phenomenon5) 15.08)
	(= (slew_time Phenomenon5 Phenomenon7) 15.08)
	(= (slew_time Phenomenon7 Planet6) 22.68)
	(= (slew_time Planet6 Phenomenon7) 22.68)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Phenomenon4 image0)
	(have_image Phenomenon5 infrared2)
	(have_image Planet6 image1)
	(have_image Phenomenon7 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star2 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 171 to 152.04, (fuel-used) from 0 to 18.96
   goals met: 1 of 5
2. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 152.04 to 150.359, (fuel-used) from 18.96 to 20.641
   goals met: 0 of 5
3. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 150.359 to 148.678, (fuel-used) from 20.641 to 22.322
   goals met: 1 of 5
4. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 148.678 to 146.997, (fuel-used) from 22.322 to 24.003
   goals met: 0 of 5
5. (turn_to satellite0 star1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 146.997 to 138.126, (fuel-used) from 24.003 to 32.874
   goals met: 0 of 5
6. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
7. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 5
8. (turn_to satellite0 phenomenon4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 138.126 to 81.356, (fuel-used) from 32.874 to 89.644
   goals met: 0 of 5
9. (take_image satellite0 phenomenon4 instrument1 image0)
   added: (have_image phenomenon4 image0)
   changed: (data_capacity satellite0) from 1000 to 864, (data-stored) from 0 to 136
   goals met: 1 of 5
10. (turn_to satellite0 planet6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 81.356 to 65.796, (fuel-used) from 89.644 to 105.204
   goals met: 1 of 5
11. (turn_to satellite0 phenomenon7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 65.796 to 43.116, (fuel-used) from 105.204 to 127.884
   goals met: 1 of 5
12. (take_image satellite0 phenomenon7 instrument1 image1)
   added: (have_image phenomenon7 image1)
   changed: (data_capacity satellite0) from 864 to 570, (data-stored) from 136 to 430
   goals met: 2 of 5
13. (turn_to satellite0 phenomenon5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 43.116 to 28.036, (fuel-used) from 127.884 to 142.964
   goals met: 2 of 5
14. (take_image satellite0 phenomenon5 instrument1 infrared2)
   added: (have_image phenomenon5 infrared2)
   changed: (data_capacity satellite0) from 570 to 273, (data-stored) from 430 to 727
   goals met: 3 of 5
15. (turn_to satellite0 star1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 28.036 to 12.816, (fuel-used) from 142.964 to 158.184
   goals met: 3 of 5
16. (turn_to satellite0 planet6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 12.816 to 3.945, (fuel-used) from 158.184 to 167.055
   goals met: 3 of 5
17. (take_image satellite0 planet6 instrument1 image1)
   added: (have_image planet6 image1)
   changed: (data_capacity satellite0) from 273 to 193, (data-stored) from 727 to 807
   goals met: 4 of 5
18. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 3.945 to 2.264, (fuel-used) from 167.055 to 168.736
   goals met: 5 of 5
